Revit 2027 API
LoadBase.HostElementId Property
 The host element ID for the load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId HostElementId { get; }
Public ReadOnly Property HostElementId As ElementId
	Get
public:
property ElementId^ HostElementId {
	ElementId^ get ();
}
member HostElementId : ElementId with get
Property Value
ElementId
Remarks
 If the load is hosted this is the id of the Analytical Element that hosts the load. If the load is not hosted, InvalidElementId is returned.
See Also
Reference
LoadBase Class
Autodesk.Revit.DB.Structure Namespace